#include <stdio.h>

//6、奖金根据利润提成。利润I低于或等于10万元时，奖金可提成10%；
// 利润高于10万元，低于20万元（100000<I≤200000）时，其中10万元按10%提成，
// 高于10万元的部分，可提成7.5%；200000<I≤400000时，其中20万元仍按上述办法提成（下同），
// 高于20万元的部分按5%提成；400000<I≤600000 时，高于40万元的部分按3%提成；
// 600000〈I≤1000000时，高于60万的部分按1.5%提成；I>1000000时，超过100万元的部分按1%提成。
// 从键盘输入当月利润I，求应发放奖金总数。要求：(1)用if语句编程序；(2)用switch语句编程序。
int main() {
    long i = 0;
    scanf("%ld", &i);
    if(i<=100000){
        printf("%.2f",i*0.1);
    } else if(i<=200000){
        printf("%.2f",100000*0.1+(i-100000)*0.075);
    }else if(i<=400000){
        printf("%.2f",100000*0.1+100000*0.075+(i-200000)*0.05);
    }else if(i<=600000){
        printf("%.2f",100000*0.1+100000*0.075+200000*0.05+(i-400000)*0.03);
    }else if(i<=1000000){
        printf("%.2f",100000*0.1+100000*0.075+200000*0.05+200000*0.03+(i-600000)*0.015);
    }else {
        printf("%.2f",100000*0.1+100000*0.075+200000*0.05+200000*0.03+400000*0.015+(i-1000000)*0.01);
    }
    return 0;
}
